Public Attributes | List of all members
API_RubberLineInfo Struct Reference
User input management
Parameters of the rubber line callback function. More...
#include <APIdefs_Interface.h>
 Public Attributes
API_Coord3D  | actCoord
The actual mouse coordinate.
bool  | drawFlag
The callback function is called from drawing or deleting phase.
Detailed Description
Parameters of the rubber line callback function.
Remarks
See RubberLineInfoProc for more information and the ACAPI_UserInput_DrawRubberLine function for example of using the rubber line drawing callback function.
Member Data Documentation
◆ actCoord
 API_RubberLineInfo::actCoord
The actual mouse coordinate.
◆ drawFlag
 API_RubberLineInfo::drawFlag
The callback function is called from drawing or deleting phase.